{
  "metadata": {
    "total_size": 18157162496
  },
  "weight_map": {
    "context_embedder.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "double_stream_modulation_img.linear.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "double_stream_modulation_txt.linear.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "norm_out.linear.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "proj_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_stream_modulation.linear.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.10.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.10.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.10.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.10.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.11.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.11.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.11.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.11.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.12.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.12.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.12.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.12.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.13.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.13.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.13.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.13.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.14.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.14.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.14.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.14.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.15.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.15.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.15.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.15.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.16.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.16.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.16.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.16.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.17.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.17.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.17.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.17.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.18.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.18.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.18.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.18.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.19.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.19.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.19.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.19.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.2.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.2.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.2.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.2.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.20.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.20.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.20.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.20.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.3.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.3.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.3.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.3.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.4.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.4.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.4.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.4.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.5.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.5.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.5.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.5.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.6.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.6.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.6.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.6.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.7.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.7.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.7.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.7.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.8.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.8.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.8.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.8.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.9.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.9.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.9.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.9.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "time_guidance_embed.timestep_embedder.linear_1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "time_guidance_embed.timestep_embedder.linear_2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.attn.add_k_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.attn.add_q_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.attn.add_v_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.attn.norm_added_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.attn.norm_added_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.attn.to_add_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.attn.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.attn.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.attn.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.attn.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.ff.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.ff.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.ff_context.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.0.ff_context.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.attn.add_k_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.attn.add_q_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.attn.add_v_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.attn.norm_added_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.attn.norm_added_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.attn.to_add_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.attn.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.attn.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.attn.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.attn.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.ff.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.ff.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.ff_context.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.1.ff_context.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.attn.add_k_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.attn.add_q_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.attn.add_v_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.attn.norm_added_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.attn.norm_added_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.attn.to_add_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.attn.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.attn.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.attn.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.attn.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.ff.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.ff.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.ff_context.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.2.ff_context.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.attn.add_k_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.attn.add_q_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.attn.add_v_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.attn.norm_added_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.attn.norm_added_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.attn.to_add_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.attn.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.attn.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.attn.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.attn.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.ff.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.ff.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.ff_context.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.3.ff_context.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.attn.add_k_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.attn.add_q_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.attn.add_v_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.attn.norm_added_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.attn.norm_added_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.attn.to_add_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.attn.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.attn.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.attn.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.attn.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.ff.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.ff.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.ff_context.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.4.ff_context.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.attn.add_k_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.attn.add_q_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.attn.add_v_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.attn.norm_added_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.attn.norm_added_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.attn.to_add_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.attn.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.attn.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.attn.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.attn.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.ff.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.ff.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.ff_context.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.5.ff_context.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.attn.add_k_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.attn.add_q_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.attn.add_v_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.attn.norm_added_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.attn.norm_added_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.attn.to_add_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.attn.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.attn.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.attn.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.attn.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.ff.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.ff.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.ff_context.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.6.ff_context.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.attn.add_k_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.attn.add_q_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.attn.add_v_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.attn.norm_added_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.attn.norm_added_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.attn.to_add_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.attn.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.attn.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.attn.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.attn.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.ff.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.ff.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.ff_context.linear_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "transformer_blocks.7.ff_context.linear_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "x_embedder.weight": "diffusion_pytorch_model-00001-of-00002.safetensors"
  }
}
