{
  "metadata": {
    "total_size": 18125648967
  },
  "weight_map": {
    "context_embedder.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "context_embedder.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "context_embedder.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "context_embedder.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "double_stream_modulation_img.linear.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "double_stream_modulation_img.linear.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "double_stream_modulation_img.linear.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "double_stream_modulation_img.linear.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "double_stream_modulation_txt.linear.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "double_stream_modulation_txt.linear.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "double_stream_modulation_txt.linear.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "double_stream_modulation_txt.linear.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "norm_out.linear.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "norm_out.linear.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "norm_out.linear.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "norm_out.linear.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "proj_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "proj_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "proj_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "proj_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_stream_modulation.linear.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_stream_modulation.linear.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_stream_modulation.linear.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_stream_modulation.linear.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.to_out.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.0.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.to_out.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.1.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.10.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.10.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.10.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.10.attn.to_out.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.10.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.10.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.10.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.10.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.10.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.10.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.11.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.11.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.11.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.11.attn.to_out.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.11.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.11.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.11.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.11.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.11.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.11.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.12.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.12.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.12.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.12.attn.to_out.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.12.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.12.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.12.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.12.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.12.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.12.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.13.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.13.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.13.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.13.attn.to_out.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.13.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.13.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.13.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.13.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.13.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.13.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.14.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.14.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.14.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.14.attn.to_out.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.14.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.14.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.14.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.14.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.14.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.14.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.15.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.15.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.15.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.15.attn.to_out.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.15.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.15.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.15.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.15.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.15.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.15.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.16.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.16.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.16.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.16.attn.to_out.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.16.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.16.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.16.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.16.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.16.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.16.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.17.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.17.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.17.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.17.attn.to_out.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.17.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.17.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.17.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.17.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.17.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.17.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.18.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.18.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.18.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.18.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.18.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.18.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.18.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.18.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.18.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.18.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.19.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.19.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.19.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.19.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.19.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.19.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.19.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.19.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.19.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.19.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.2.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.2.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.2.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.2.attn.to_out.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.2.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.2.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.2.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.2.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.2.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.2.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.20.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.20.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.20.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.20.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.20.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.20.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.20.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.20.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.20.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.20.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.21.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.22.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.23.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.24.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.24.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.24.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.24.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.24.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.24.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.24.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.24.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.24.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.24.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.25.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.25.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.25.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.25.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.25.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.25.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.25.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.25.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.25.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.25.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.26.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.26.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.26.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.26.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.26.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.26.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.26.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.26.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.26.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.26.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.27.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.27.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.27.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.27.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.27.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.27.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.27.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.27.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.27.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.27.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.28.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.28.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.28.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.28.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.28.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.28.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.28.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.28.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.28.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.28.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.29.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.29.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.29.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.29.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.29.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.29.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.29.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.29.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.29.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.29.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.3.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.3.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.3.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.3.attn.to_out.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.3.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.3.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.3.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.3.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.3.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.3.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.30.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.30.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.30.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.30.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.30.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.30.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.30.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.30.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.30.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.30.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.31.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.31.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.31.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.31.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.31.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.31.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.31.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.31.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.31.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.31.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.32.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.32.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.32.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.32.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.32.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.32.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.32.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.32.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.32.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.32.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.33.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.33.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.33.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.33.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.33.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.33.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.33.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.33.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.33.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.33.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.34.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.34.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.34.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.34.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.34.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.34.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.34.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.34.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.34.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.34.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.35.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.35.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.35.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.35.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.35.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.35.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.35.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.35.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.35.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.35.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.36.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.36.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.36.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.36.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.36.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.36.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.36.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.36.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.36.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.36.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.37.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.37.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.37.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.37.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.37.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.37.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.37.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.37.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.37.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.37.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.38.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.38.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.38.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.38.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.38.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.38.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.38.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.38.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.38.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.38.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.39.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.39.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.39.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.39.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.39.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.39.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.39.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.39.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.39.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.39.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.4.attn.norm_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.4.attn.norm_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.4.attn.to_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.4.attn.to_out.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.4.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.4.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.4.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.4.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.4.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.4.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "single_transformer_blocks.40.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.40.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.40.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.40.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.40.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.40.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.40.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.40.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.40.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.40.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.41.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.41.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.41.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.41.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.41.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.41.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.41.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.41.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.41.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.41.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.42.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.42.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.42.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.42.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.42.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.42.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.42.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.42.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.42.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.42.attn.to_qkv_mlp_proj.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.43.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.43.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.43.attn.to_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.43.attn.to_out.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.43.attn.to_out.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.43.attn.to_out.weight.quant_state.bitsandbytes__nf4": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.43.attn.to_qkv_mlp_proj.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.43.attn.to_qkv_mlp_proj.weight.absmax": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "single_transformer_blocks.43.attn.to_qkv_mlp_proj.weight.quant_map": "diffusion_pytorch_model-00002-of-00002.safetensors",
