{
  "_class_name": "QwenImageEditPlusPipeline",
  "_diffusers_version": "0.36.0.dev0",
  "processor": [
    "transformers",
    "Qwen2VLProcessor"
  ],
  "scheduler": [
    "diffusers",
    "FlowMatchEulerDiscreteScheduler"
  ],
  "text_encoder": [
    "transformers",
    "Qwen2_5_VLForConditionalGeneration"
  ],
  "tokenizer": [
    "transformers",
    "Qwen2Tokenizer"
  ],
  "transformer": [
    "diffusers",
    "QwenImageTransformer2DModel"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKLQwenImage"
  ]
}
