{
  "metadata": {
    "total_size": 24619634944
  },
  "weight_map": {
    "all_final_layer.2-1.adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "all_final_layer.2-1.adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "all_final_layer.2-1.linear.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "all_final_layer.2-1.linear.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "all_x_embedder.2-1.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "all_x_embedder.2-1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "cap_embedder.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "cap_embedder.1.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "cap_embedder.1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "cap_pad_token": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.0.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.0.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.0.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.0.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.0.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.0.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.0.attention_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.0.attention_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.0.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.0.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.0.feed_forward.w3.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.0.ffn_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.0.ffn_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.1.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.1.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.1.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.1.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.1.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.1.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.1.attention_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.1.attention_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.1.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.1.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.1.feed_forward.w3.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.1.ffn_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "context_refiner.1.ffn_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.adaLN_modulation.0.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.adaLN_modulation.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.attention_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.attention_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.feed_forward.w3.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.ffn_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.0.ffn_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.adaLN_modulation.0.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.adaLN_modulation.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.attention_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.attention_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.feed_forward.w3.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.ffn_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.1.ffn_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.10.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.feed_forward.w2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.10.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.feed_forward.w2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.11.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.feed_forward.w2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.12.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.feed_forward.w2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.13.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.feed_forward.w2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.14.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.feed_forward.w2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.15.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.feed_forward.w2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.16.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.feed_forward.w2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.17.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.feed_forward.w2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.18.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.feed_forward.w2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.19.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.2.adaLN_modulation.0.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.adaLN_modulation.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.attention_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.attention_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.feed_forward.w3.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.ffn_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.2.ffn_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.20.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.feed_forward.w2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.20.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.feed_forward.w2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.21.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.feed_forward.w2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.22.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.23.adaLN_modulation.0.bias": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.23.adaLN_modulation.0.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.23.attention.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.23.attention.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.23.attention.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.23.attention.to_out.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.23.attention.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.23.attention.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.23.attention_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.23.attention_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.23.feed_forward.w1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.23.feed_forward.w2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.23.feed_forward.w3.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.23.ffn_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.23.ffn_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.adaLN_modulation.0.bias": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.adaLN_modulation.0.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.attention.norm_k.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.attention.norm_q.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.attention.to_k.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.attention.to_out.0.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.attention.to_q.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.attention.to_v.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.attention_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.attention_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.feed_forward.w1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.feed_forward.w2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.feed_forward.w3.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.ffn_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.24.ffn_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.adaLN_modulation.0.bias": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.adaLN_modulation.0.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.attention.norm_k.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.attention.norm_q.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.attention.to_k.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.attention.to_out.0.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.attention.to_q.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.attention.to_v.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.attention_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.attention_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.feed_forward.w1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.feed_forward.w2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.feed_forward.w3.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.ffn_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.25.ffn_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.adaLN_modulation.0.bias": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.adaLN_modulation.0.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.attention.norm_k.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.attention.norm_q.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.attention.to_k.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.attention.to_out.0.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.attention.to_q.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.attention.to_v.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.attention_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.attention_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.feed_forward.w1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.feed_forward.w2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.feed_forward.w3.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.ffn_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.26.ffn_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.adaLN_modulation.0.bias": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.adaLN_modulation.0.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.attention.norm_k.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.attention.norm_q.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.attention.to_k.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.attention.to_out.0.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.attention.to_q.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.attention.to_v.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.attention_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.attention_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.feed_forward.w1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.feed_forward.w2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.feed_forward.w3.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.ffn_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.27.ffn_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.adaLN_modulation.0.bias": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.adaLN_modulation.0.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.attention.norm_k.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.attention.norm_q.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.attention.to_k.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.attention.to_out.0.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.attention.to_q.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.attention.to_v.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.attention_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.attention_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.feed_forward.w1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.feed_forward.w2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.feed_forward.w3.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.ffn_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.28.ffn_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.adaLN_modulation.0.bias": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.adaLN_modulation.0.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.attention.norm_k.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.attention.norm_q.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.attention.to_k.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.attention.to_out.0.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.attention.to_q.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.attention.to_v.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.attention_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.attention_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.feed_forward.w1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.feed_forward.w2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.feed_forward.w3.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.ffn_norm1.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.29.ffn_norm2.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
    "layers.3.adaLN_modulation.0.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.adaLN_modulation.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.attention_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.attention_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.feed_forward.w3.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.ffn_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.3.ffn_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.adaLN_modulation.0.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.adaLN_modulation.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.attention_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.attention_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.feed_forward.w3.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.ffn_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.4.ffn_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.adaLN_modulation.0.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.adaLN_modulation.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.attention_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.attention_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.feed_forward.w3.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.ffn_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.5.ffn_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.adaLN_modulation.0.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.adaLN_modulation.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.attention_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.attention_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.feed_forward.w3.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.ffn_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.6.ffn_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.adaLN_modulation.0.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.adaLN_modulation.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.attention_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.attention_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.feed_forward.w3.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.ffn_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.7.ffn_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.adaLN_modulation.0.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.adaLN_modulation.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.attention_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.attention_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.feed_forward.w3.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.ffn_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.8.ffn_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.9.adaLN_modulation.0.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.9.adaLN_modulation.0.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.9.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.9.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.9.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.9.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.9.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.9.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.9.attention_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.9.attention_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.9.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.9.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "layers.9.feed_forward.w3.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.9.ffn_norm1.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "layers.9.ffn_norm2.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
    "noise_refiner.0.adaLN_modulation.0.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.adaLN_modulation.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.attention_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.attention_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.feed_forward.w3.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.ffn_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.0.ffn_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.adaLN_modulation.0.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.adaLN_modulation.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.attention.norm_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.attention.norm_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.attention.to_k.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.attention.to_out.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.attention.to_q.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.attention.to_v.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.attention_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.attention_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.feed_forward.w1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.feed_forward.w2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.feed_forward.w3.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.ffn_norm1.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "noise_refiner.1.ffn_norm2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "t_embedder.mlp.0.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "t_embedder.mlp.0.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "t_embedder.mlp.2.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "t_embedder.mlp.2.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
    "x_pad_token": "diffusion_pytorch_model-00001-of-00003.safetensors"
  }
}
